Autodesk.Revit.DB.RadialArray.GetNumberOfMembersIncludingPlaceholders
Returns the number of items in an array, including placeholder items in families.
Remarks:
To find the number of placeholder elements in a family, subtract the value
of the NumMembers property from this value.
Returns:
The number of elements in an array, including placeholder items in families.
Since:
2025

Autodesk.Revit.DB.RadialArray.GetMinimumSize(Autodesk.Revit.DB.Document)
Returns the minimum size for a radial array based on the document.
Remarks:
This value is 3 in projects and 0 in families.
document:
The document.
Returns:
The minimum size of an array.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.RadialArray.IsValidNumberOfMembers(System.Int32,Autodesk.Revit.DB.Document)
This indicates whether the input count is a valid size for an array based on the document.
Remarks:
In project documents, the array count must be between 3 and 200.
In family documents, the array count must be between 0 and 200.
count:
The count.
pADoc:
The document.
Returns:
True if an array can be set to the specified count in the given document, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.RadialArray.IsValidArraySize(System.Int32)
This indicates whether the input count is valid in the project environment.
count:
The count.
Returns:
True if the input count is between 3 and 200, false otherwise.

Autodesk.Revit.DB.RadialArray.ArrayElementWithoutAssociation(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId,System.Int32,Autodesk.Revit.DB.Line,System.Double,Autodesk.Revit.DB.ArrayAnchorMember)
Creates a new radial array from a single element based
on an input rotation axis.
Remarks:
The resulting elements will not be associated with an array element.
aDoc:
The view. If it is a 2d view, translation vector must be in the view plane if the element is a view-specific element.
dBView:
The view.
id:
The element to array. The position of the rotation
axis is determined by the center of the element's bounding boxes.
count:
The number of array members to create.
The accepted range is from 3 to 200 in a project document, and between 0 and 200 in a family document.
axis:
The rotation axis.
angle:
The angle in radians of the rotation.
anchorMember:
Indicates if the translation vector specifies the location of the second member
of the array, or the last member of the array.
Returns:
The elements created by the operation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element id does not exist in the document
-or-
id is not arrayable.
-or-
count must be between 3 and 200 in project documents and between 0 and 200 in family documents.
-or-
The view is invalid for specific view elements array.
-or-
The rotation axis is invalid to array the element.
-or-
Angle value must be not zero.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the radial array.

Autodesk.Revit.DB.RadialArray.ArrayElementsWithoutAssociation(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},System.Int32,Autodesk.Revit.DB.Line,System.Double,Autodesk.Revit.DB.ArrayAnchorMember)
Creates a new radial array from a set of elements based
on an input rotation axis.
Remarks:
The resulting elements will not be associated with an array element.
aDoc:
The document.
dBView:
The view. If it is a 2d view, translation vector must be in the view plane if elements include view-specific elements.
If elements include view-specific elements, they must belong to this view.
ids:
The set of elements to array. The position of the rotation
axis is determined by the cumulative center of the elements' bounding boxes.
count:
The number of array members to create.
The accepted range is from 3 to 200 in a project document, and between 0 and 200 in a family document.
axis:
The rotation axis.
angle:
The angle in radians of the rotation.
anchorMember:
Indicates if the translation vector specifies the location of the second member
of the array, or the last member of the array.
Returns:
The elements created by the operation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given element id set is empty.
-or-
One or more elements in ids do not exist in the document.
-or-
One or more elements in ids is owned by different views and thus cannot be arrayed together.
-or-
One or more elements in ids is not arrayable.
-or-
count must be between 3 and 200 in project documents and between 0 and 200 in family documents.
-or-
The view is invalid for specific view elements array.
-or-
The rotation axis is invalid to array the elements.
-or-
Angle value must be not zero.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the radial array.

Autodesk.Revit.DB.RadialArray.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId,System.Int32,Autodesk.Revit.DB.Line,System.Double,Autodesk.Revit.DB.ArrayAnchorMember)
Creates a new radial array element from a single element based
on an input rotation axis.
aDoc:
The document.
dBView:
The view. If it is a 2d view, translation vector must be in the view plane if the element is a view-specific element.
id:
The element to array. The position of the rotation
axis is determined by the center of the element's bounding boxes.
count:
The number of array members to create.
The accepted range is from 3 to 200 in a project document, and between 0 and 200 in a family document.
axis:
The rotation axis.
angle:
The angle in radians of the rotation.
anchorMember:
Indicates if the translation vector specifies the location of the second member
of the array, or the last member of the array.
Returns:
The new radial array element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element id does not exist in the document
-or-
id is not arrayable.
-or-
count must be between 3 and 200 in project documents and between 0 and 200 in family documents.
-or-
The view is invalid for specific view elements array.
-or-
The rotation axis is invalid to array the element.
-or-
Angle value must be not zero.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the radial array.

Autodesk.Revit.DB.RadialArray.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},System.Int32,Autodesk.Revit.DB.Line,System.Double,Autodesk.Revit.DB.ArrayAnchorMember)
Creates a new radial array element from a set of elements based
on an input rotation axis.
aDoc:
The document.
dBView:
The view. If it is a 2d view, translation vector must be in the view plane if elements include view-specific elements.
If elements include view-specific elements, they must belong to this view.
ids:
The set of elements to array. The position of the rotation
axis is determined by the cumulative center of the elements' bounding boxes.
count:
The number of array members to create.
The accepted range is from 3 to 200 in a project document, and between 0 and 200 in a family document.
axis:
The rotation axis.
angle:
The angle in radians of the rotation.
anchorMember:
Indicates if the translation vector specifies the location of the second member
of the array, or the last member of the array.
Returns:
The new radial array element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given element id set is empty.
-or-
One or more elements in ids do not exist in the document.
-or-
One or more elements in ids is owned by different views and thus cannot be arrayed together.
-or-
One or more elements in ids is not arrayable.
-or-
count must be between 3 and 200 in project documents and between 0 and 200 in family documents.
-or-
The view is invalid for specific view elements array.
-or-
The rotation axis is invalid to array the elements.
-or-
Angle value must be not zero.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the radial array.

Autodesk.Revit.DB.RadialArray.GetCopiedMemberIds
Retrieves the copied member ids from the array. The first item in an array contains the original elements from which the array was created. All other items in the array are copies.
Remarks: Note that in the family environment, arrays of count less than 3 are filled with placeholder items so that there are at least 2 copied items. The member ids from these placeholder items are returned too.
Returns: The copied member ids of the Array
Since: 2013

Autodesk.Revit.DB.RadialArray.GetOriginalMemberIds
Retrieves the ids for the original elements from which the array was created. These elements form the first item in the array.
Remarks: In the family environment, arrays with count 0 use the original elements as a placeholder item for the first array item. The ids of the original elements from which the array was created are returned even for arrays of count 0.
Returns: The original member ids of the Array
Since: 2013

Autodesk.Revit.DB.RadialArray.NumMembers
Retrieves or changes the number of arrayed members. Array placeholder members in the family environment are not counted.